web_pmu/controllers/SiteController.php

    public function actionIndex()
    {
        $map = Tcontact::find()->where('id_type=9')->one();
        $bible = Thistory::find()->where('history_type=9')->andWhere('d_history=7')->one();
        $banner = Banner::find()->where('unit=9')->one();
        $article = Tjournal::find()->where('unit=9')->andWhere('d_journal=4')->orderBy('id DESC')->limit(4)->all();
        $news = Tnew::find()->where('newtype_id=11')->orderBy('id DESC')->limit(4)->all();
---
SELECT * FROM `t_contact` WHERE id_type=9
SELECT * FROM `t_history` WHERE (history_type=9) AND (d_history=7)
SELECT * FROM `banner` WHERE unit=9
SELECT * FROM `t_journal` WHERE (unit=9) AND (d_journal=4) ORDER BY `id` DESC LIMIT 4
SELECT * FROM `t_new` WHERE newtype_id=11 ORDER BY `id` DESC LIMIT 4