web_pmu/controllers/TcontactController.php

    public function actionContact()
    {
        $model = Tcontact::find()->where('id_type=9')->one();
        $bible = Thistory::find()->where('history_type=9')->andWhere('d_history=7')->one();
---
SELECT * FROM `t_contact` WHERE id_type=9
SELECT * FROM `t_history` WHERE (history_type=9) AND (d_history=7)