web_pmu/controllers/TdocumentController.php

    public function actionDocument()
    {
        $model = Tdocument::find()->where('type_id=8')->groupBy(['doc_type'])->all();
---
SELECT * FROM `t_document` WHERE type_id=9 GROUP BY `doc_type`