web_pmu/controllers/ThistoryController.php

SELECT * FROM `t_history` WHERE (history_type=9) AND (d_history=7)
---
    protected function findModel($id)
    {
        if (($model = Thistory::findOne($id)) !== null) {

SELECT * FROM `t_history` WHERE (history_type=9) AND (d_history=1) ORDER BY `id` DESC
---
    public function actionAbout()
    {
        $model = Thistory::find()->where('history_type=8')->andWhere('d_history=1')->orderBy('id DESC')->one();

SELECT * FROM `t_history` WHERE (history_type=9) AND (d_history=4)
SELECT * FROM `t_history` WHERE (history_type=9) AND (d_history=5)
SELECT * FROM `t_history` WHERE (history_type=9) AND (d_history=6)
---
    public function actionTus()
    {
        $model = Thistory::find()->where('history_type=8')->andWhere('d_history=4')->one();
        $objective = Thistory::find()->where('history_type=8')->andWhere('d_history=5')->one();
        $goal = Thistory::find()->where('history_type=8')->andWhere('d_history=6')->one();

SELECT * FROM `t_history` WHERE (history_type=9) AND (d_history=7)
---
    public function actionBible()
    {
        $model = Thistory::find()->where('history_type=8')->andWhere('d_history=7')->one();

SELECT * FROM `t_history` WHERE (history_type=9) AND (d_history=9)
---
    public function actionPan()
    {
        $model = Thistory::find()->where('history_type=8')->andWhere('d_history=9')->one();
        $yut = Thistory::find()->where('history_type=8')->andWhere('d_history=11')->one();

SELECT * FROM `t_history` WHERE (history_type=9) AND (d_history=7)
---
    public function actionYut()
    {
        $model = Thistory::find()->where('history_type=8')->andWhere('d_history=10')->one();

SELECT * FROM `t_history` WHERE (history_type=9) AND (d_history=7)
---
    public function actionStruct()
    {
        $model = Thistory::find()->where('history_type=8')->andWhere('d_history=3')->one();

SELECT * FROM `t_history` WHERE (history_type=9) AND (d_history=2)
---
    public function actionHistory()
    {
        $model = Thistory::find()->where('history_type=8')->andWhere('d_history=2')->one();