web_pmu/controllers/TjournalController.php

    public function actionArticle()
   {
       //$model = Tjournal::find()->where('unit=8')->orderBy('id DESC')->all();

       $query = Tjournal::find()->where('unit=8')->andWhere('d_journal=2')->orderBy('id DESC');

        // get the total number of articles (but do not fetch the article data yet)
        $count = $query->count();

        // create a pagination object with the total count
        $pagination = new Pagination(['totalCount' => $count]);
        $pagination->setPageSize(6);

        // limit the query using the pagination and retrieve the articles
        $models = $query->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `t_journal` WHERE (unit=9) AND (d_journal=4)
SELECT * FROM `t_journal` WHERE (unit=9) AND (d_journal=4) ORDER BY `id` DESC LIMIT 6