web_pmu/controllers/TnewController.php

SELECT * FROM `t_new` WHERE `id`='19'
---
    protected function findModel($id)
    {
        if (($model = Tnew::findOne($id)) !== null) {

SELECT COUNT(*) FROM `t_new` WHERE `newtype_id`=11
SELECT * FROM `t_new` WHERE `newtype_id`=11 ORDER BY `id` DESC LIMIT 4
---
    public function actionNews()
    {
        //$model = Tnew::find()->where('newtype_id=9')->orderBy('id DESC')->all();
        $query = Tnew::find()->where(['newtype_id' => 9])->orderBy('id DESC');

        // get the total number of articles (but do not fetch the article data yet)
        $count = $query->count();

        // create a pagination object with the total count
        $pagination = new Pagination(['totalCount' => $count]);
        $pagination->setPageSize(4);

        // limit the query using the pagination and retrieve the articles
        $models = $query->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();