web_pmu/views/tnew/detail.php

                                <ol class="carousel-indicators">
                                <?php
                                $newreff = $model->ref;
                                $picc = Uploads::find()->where(['ref'=> $newreff])->count();
---
SELECT COUNT(*) FROM `uploads` WHERE `ref`='pmu_news2'

                                <?php
                                $j=0;
                                //$newreff = $model->ref;
                                $test2 = Uploads::find()->where(['ref'=> $newreff])->all();
---
SELECT * FROM `uploads` WHERE `ref`='pmu_news2'