web_women/views/tnew/news.php

                    <div class="panel-body box-news">
                        <div>
                            <?php
                                $pic = Uploads::find()->where(['ref'=> $newref])->orderBy('upload_id ASC')->limit(1)->all();
---
SELECT * FROM `uploads` WHERE `ref`='sdsu_news8' ORDER BY `upload_id` LIMIT 1