web_women/views/site/index.php

                <ol class="carousel-indicators">
                <?php
                $newreff = $banner->ref;
                $count_banner = Uploads::find()->where(['ref'=> $newreff])->count();
---
SELECT COUNT(*) FROM `uploads` WHERE `ref`='banner_sdsu'

                <?php
                $j=0;
                //$newreff = $model->ref;
                $test2 = Uploads::find()->where(['ref'=> $newreff])->orderBy('upload_id DESC')->all();
---
SELECT * FROM `uploads` WHERE `ref`='banner_sdsu' ORDER BY `upload_id` DESC

                    <div class="col-md-3">
                        <div class="thumbnail box-news">
                            <?php
                                $pic = Uploads::find()->where(['ref'=> $newref])->orderBy('upload_id ASC')->one();
---
SELECT * FROM `uploads` WHERE `ref`='sdsu_news8' ORDER BY `upload_id`