web_pmu/views/tdocument/document.php

                        <b><p class="h-box-form"><?php echo $doc->doctype->doc_th ?></p></b>

                        <?php
                            $tdocument = Tdocument::find()->where('type_id=9')->andWhere(['doc_type'=>$doc->doctype->id])->all();
---
SELECT * FROM `t_document` WHERE (type_id=9) AND (`doc_type`=4)