web_women/controllers/SiteController.php

SELECT * FROM `t_contact` WHERE id_type=10
SELECT * FROM `banner` WHERE unit=8
SELECT * FROM `t_history` WHERE (history_type=10) AND (d_history=7)
SELECT * FROM `t_journal` WHERE (unit=10) AND (d_journal=5) ORDER BY `id` DESC LIMIT 4
SELECT * FROM `t_new` WHERE newtype_id=9 ORDER BY `id` DESC LIMIT 4
---
    public function actionIndex()
    {
        $map = Tcontact::find()->where('id_type=10')->one();
        $banner = Banner::find()->where('unit=8')->one();
        $bible = Thistory::find()->where('history_type=10')->andWhere('d_history=7')->one();
        $article = Tjournal::find()->where('unit=10')->andWhere('d_journal=5')->orderBy('id DESC')->limit(4)->all();

        $news = Tnew::find()->where('newtype_id=9')->orderBy('id DESC')->limit(4)->all();