web_women/controllers/TcontactController.php

    public function actionContact()
    {
        $model = Tcontact::find()->where('id_type=10')->one();
        $bible = Thistory::find()->where('history_type=10')->andWhere('d_history=7')->one();
---
SELECT * FROM `t_contact` WHERE id_type=10
SELECT * FROM `t_history` WHERE (history_type=10) AND (d_history=7)