web_women/controllers/TdocumentController.php

    public function actionDocument()
    {
        $model = Tdocument::find()->where('type_id=10')->andWhere('doc_type=8')->all();
---
SELECT * FROM `t_document` WHERE (type_id=10) AND (doc_type=8)