web_women/controllers/ThistoryController.php

    public function actionAbout()
    {
        $model = Thistory::find()->where('history_type=10')->andWhere('d_history=1')->orderBy('id DESC')->one();
        $bible = Thistory::find()->where('history_type=10')->andWhere('d_history=7')->one();
---
SELECT * FROM `t_history` WHERE (history_type=10) AND (d_history=1) ORDER BY `id` DESC
SELECT * FROM `t_history` WHERE (history_type=10) AND (d_history=7)

    public function actionBible()
    {
        $model = Thistory::find()->where('history_type=10')->andWhere('d_history=7')->one();
---
SELECT * FROM `t_history` WHERE (history_type=10) AND (d_history=7)

    public function actionPan()
    {
        $model = Thistory::find()->where('history_type=10')->andWhere('d_history=9')->one();
        $yut = Thistory::find()->where('history_type=10')->andWhere('d_history=10')->one();
        $bible = Thistory::find()->where('history_type=10')->andWhere('d_history=7')->one();
---
SELECT * FROM `t_history` WHERE (history_type=10) AND (d_history=9)
SELECT * FROM `t_history` WHERE (history_type=10) AND (d_history=10)
SELECT * FROM `t_history` WHERE (history_type=10) AND (d_history=7)

    public function actionYut()
    {
        $model = Thistory::find()->where('history_type=10')->andWhere('d_history=15')->one();
        $bible = Thistory::find()->where('history_type=10')->andWhere('d_history=7')->one();
---
SELECT * FROM `t_history` WHERE (history_type=10) AND (d_history=15)
SELECT * FROM `t_history` WHERE (history_type=10) AND (d_history=7)

    public function actionWat()
    {
        $model = Thistory::find()->where('history_type=10')->andWhere('d_history=11')->one();
        $bible = Thistory::find()->where('history_type=10')->andWhere('d_history=7')->one();
---
SELECT * FROM `t_history` WHERE (history_type=10) AND (d_history=11)
SELECT * FROM `t_history` WHERE (history_type=10) AND (d_history=7)

    public function actionPlan()
    {

         $model = Thistory::find()->where('history_type=10')->andWhere('d_history=14')->orderBy('id ASC')->one();
         $bible = Thistory::find()->where('history_type=10')->andWhere('d_history=7')->one();
---
SELECT * FROM `t_history` WHERE (history_type=10) AND (d_history=14) ORDER BY `id`
SELECT * FROM `t_history` WHERE (history_type=10) AND (d_history=7)