web_women/controllers/TjournalController.php

SELECT * FROM `t_history` WHERE (history_type=10) AND (d_history=7)
SELECT COUNT(*) FROM `t_journal` WHERE (unit=10) AND (d_journal=5)
SELECT * FROM `t_journal` WHERE (unit=10) AND (d_journal=5) ORDER BY `id` DESC LIMIT 6
---
    public function actionArticle()
   {
       //$model = Tjournal::find()->where('unit=8')->orderBy('id DESC')->all();
       $bible = Thistory::find()->where('history_type=10')->andWhere('d_history=7')->one();
       $query = Tjournal::find()->where('unit=10')->andWhere('d_journal=5')->orderBy('id DESC');

        // get the total number of articles (but do not fetch the article data yet)
        $count = $query->count();

        // create a pagination object with the total count
        $pagination = new Pagination(['totalCount' => $count]);
        $pagination->setPageSize(6);

        // limit the query using the pagination and retrieve the articles
        $models = $query->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();

SELECT * FROM `t_journal` WHERE (unit=10) AND (d_journal=6) ORDER BY `id`
SELECT * FROM `t_history` WHERE (history_type=10) AND (d_history=7)
---
   public function actionArticle2()
   {

        $article2 = Tjournal::find()->where('unit=10')->andWhere('d_journal=6')->orderBy('id ASC')->all();
        $bible = Thistory::find()->where('history_type=10')->andWhere('d_history=7')->one();