web_women/controllers/TprojectController.php

        public function actionProject()
    {
        $year = date("Y");
        $model = Tproject::find()->where('type_id=10')->andWhere(['year'=> $year])->all();
        $name = Tproject::find()->where('type_id=10')->andWhere(['year'=> $year])->one();
        $bible = Thistory::find()->where('history_type=10')->andWhere('d_history=7')->one();
---
SELECT * FROM `t_project` WHERE (type_id=10) AND (`year`='2018')
SELECT * FROM `t_history` WHERE (history_type=10) AND (d_history=7)