web_pmu/views/site/index.php

SELECT COUNT(*) FROM `uploads` WHERE `ref`='banner_pmu'
---
                <ol class="carousel-indicators">
                <?php
                $newreff = $banner->ref;
                $count_banner = Uploads::find()->where(['ref'=> $newreff])->count();

SELECT * FROM `uploads` WHERE `ref`='banner_pmu' ORDER BY `upload_id` DESC
---
                <?php
                $j=0;
                //$newreff = $model->ref;
                $test2 = Uploads::find()->where(['ref'=> $newreff])->orderBy('upload_id DESC')->all();

SELECT * FROM `uploads` WHERE `ref`='pmu_news4' ORDER BY `upload_id`
---
                <div class="col-md-3">
                    <div class="thumbnail box-news">
                        <?php
                            $pic = Uploads::find()->where(['ref'=> $newref])->orderBy('upload_id ASC')->one();